In [55]:
import pandas as pd

In [70]:
fp="data/029440.txt"

In [153]:
data = pd.read_csv(
    fp, delim_whitespace=True, na_values=["*", "**", "***", "****", "*****", "******"]
)
data.head()

/tmp/ipykernel_437/4186475552.py:1: DtypeWarning: Columns (29,30,31) have mixed types. Specify dtype option on import or set low_memory=False.
  data = pd.read_csv(

,USAF,WBAN,YR--MODAHRMN,DIR,SPD,GUS,CLG,SKC,L,M,...,SLP,ALT,STP,MAX,MIN,PCP01,PCP06,PCP24,PCPXX,SD
0,29440,99999,190601010600,90.0,7.0,NaN,NaN,OVC,NaN,NaN,...,1011.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,29440,99999,190601011300,NaN,0.0,NaN,NaN,OVC,NaN,NaN,...,1015.5,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,29440,99999,190601012000,NaN,0.0,NaN,NaN,OVC,NaN,NaN,...,1016.2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,29440,99999,190601020600,NaN,0.0,NaN,NaN,CLR,NaN,NaN,...,1016.2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,29440,99999,190601021300,270.0,7.0,NaN,NaN,OVC,NaN,NaN,...,1015.6,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

All column names

In [155]:
data.columns

Index(['USAF', 'WBAN', 'YR--MODAHRMN', 'DIR', 'SPD', 'GUS', 'CLG', 'SKC', 'L',
       'M', 'H', 'VSB', 'MW', 'MW.1', 'MW.2', 'MW.3', 'AW', 'AW.1', 'AW.2',
       'AW.3', 'W', 'TEMP', 'DEWP', 'SLP', 'ALT', 'STP', 'MAX', 'MIN', 'PCP01',
       'PCP06', 'PCP24', 'PCPXX', 'SD'],
      dtype='object')

Read only selected columns

In [159]:
data = pd.read_csv(
    fp,
    delim_whitespace=True,
    usecols=["USAF", "YR--MODAHRMN", "TEMP"],
    na_values=["*", "**", "***", "****", "*****", "******"],
)
data.head()

    USAF  YR--MODAHRMN  TEMP
0  29440  190601010600  27.0
1  29440  190601011300  27.0
2  29440  190601012000  25.0
3  29440  190601020600  26.0
4  29440  190601021300  27.0

Rename columns

In [344]:
new_name={"YR--MODAHRMN":"TIME"}
type(new_names)
data=data.rename(columns=new_names)
data.columns

Index(['USAF', 'TIME', 'TEMP', 'TEMP_C', 'YEAR', 'MONTH', 'DATE'], dtype='object')

Check row col count

In [163]:
data.shape

(757983, 3)

Column data types

In [165]:
data.dtypes

USAF      int64
TIME      int64
TEMP    float64
dtype: object

Add a column and calculate

In [167]:
data["TEMP_C"]=(data["TEMP"]-32)/1.8
data.head()

    USAF          TIME  TEMP    TEMP_C
0  29440  190601010600  27.0 -2.777778
1  29440  190601011300  27.0 -2.777778
2  29440  190601012000  25.0 -3.888889
3  29440  190601020600  26.0 -3.333333
4  29440  190601021300  27.0 -2.777778

Parsing time column into year-month-day-hour-minute

In [170]:
data["TIME"]=data["TIME"].astype(str)

In [220]:
data["YEAR"]= data["TIME"].str.slice(start=0,stop=2)
data["MONTH"]=data["TIME"].str.slice(start=2,stop=4)

data.head()

    USAF          TIME  TEMP    TEMP_C YEAR MONTH
0  29440  190601010600  27.0 -2.777778   19    06
1  29440  190601011300  27.0 -2.777778   19    06
2  29440  190601012000  25.0 -3.888889   19    06
3  29440  190601020600  26.0 -3.333333   19    06
4  29440  190601021300  27.0 -2.777778   19    06

Parse using datetime

In [222]:
data["DATE"]=pd.to_datetime(data["TIME"])
data.head()

    USAF          TIME  TEMP    TEMP_C YEAR MONTH                DATE
0  29440  190601010600  27.0 -2.777778   19    06 1906-01-01 06:00:00
1  29440  190601011300  27.0 -2.777778   19    06 1906-01-01 13:00:00
2  29440  190601012000  25.0 -3.888889   19    06 1906-01-01 20:00:00
3  29440  190601020600  26.0 -3.333333   19    06 1906-01-02 06:00:00
4  29440  190601021300  27.0 -2.777778   19    06 1906-01-02 13:00:00

Group data

In [226]:
grouped=data.groupby(['YEAR','MONTH'])
data.head()

    USAF          TIME  TEMP    TEMP_C YEAR MONTH                DATE
0  29440  190601010600  27.0 -2.777778   19    06 1906-01-01 06:00:00
1  29440  190601011300  27.0 -2.777778   19    06 1906-01-01 13:00:00
2  29440  190601012000  25.0 -3.888889   19    06 1906-01-01 20:00:00
3  29440  190601020600  26.0 -3.333333   19    06 1906-01-02 06:00:00
4  29440  190601021300  27.0 -2.777778   19    06 1906-01-02 13:00:00

Access data by groups

In [234]:
type(grouped)

pandas.core.groupby.generic.DataFrameGroupBy

In [266]:
month=('19', '08')
grouped.get_group(month).head()

       USAF          TIME  TEMP     TEMP_C YEAR MONTH                DATE
2188  29440  190801010600 -16.0 -26.666667   19    08 1908-01-01 06:00:00
2189  29440  190801011300 -11.0 -23.888889   19    08 1908-01-01 13:00:00
2190  29440  190801012000   2.0 -16.666667   19    08 1908-01-01 20:00:00
2191  29440  190801020600  14.0 -10.000000   19    08 1908-01-02 06:00:00
2192  29440  190801021300  19.0  -7.222222   19    08 1908-01-02 13:00:00

In [274]:
group1["TEMP"].mean()

39.61861313868613

Create a new dataframe with mean values from each group

In [309]:
temp=pd.DataFrame()

In [342]:
temp["MEAN_TEMP"]=grouped["TEMP"].mean()
temp["YY"]=grouped["YEAR"].first()
temp["MM"]=grouped["MONTH"].first()
temp.head()

            MEAN_TEMP  YY  MM
YEAR MONTH
19   06     41.468493  19  06
     07     38.526075  19  07
     08     39.618613  19  08
     09     39.307130  19  09
     10     41.589580  19  10